---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BeamVJustificationOtherValue
source: html/0e91ecf5-c890-43f2-bbb8-2c1d59a3be6b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BeamVJustificationOtherValue Property

"z-Direction Offset Value"

## Syntax (C#)
```csharp
public static ForgeTypeId BeamVJustificationOtherValue { get; }
```